---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PerformanceAdviser..::..GetRuleName Method
PerformanceAdviser Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetRuleName(Int32) | Retrieves the name of the rule. |
|  | GetRuleName(PerformanceAdviserRuleId) | Retrieves the name of the rule. |

# See Also

PerformanceAdviser Class

PerformanceAdviser Members

Autodesk.Revit.DB Namespace